list-of-tags.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://rillonline.github.io/rss.xml"
      title="RSS feed for https://rillonline.github.io/">
<title>List of Tags</title>
</head>
<body>
<div id="preamble" class="status"><div class="sitelinks">
<a href="https://rillonline.github.io/">Home</a> | <a href="https://rillonline.github.io/list-of-tags.html">List of Tags</a> |
<a href="https://rillonline.github.io/about.html">About</a>
 </div><div><h1>Hey there 👋 You are reading Rill Online.</h1></div></div>
<div id="content">
<div class="post-date">12 Sep 2025</div><h1 class="post-title"><a href="https://rillonline.github.io/list-of-tags.html">List of Tags</a></h1>
<p>
This page lists all my tags with links to each of their individual pages. I will update this page as needed. Two special tags are <code>Blog</code> and <code>Page</code>. <code>Blog</code> basically works as a housekeeping tag. This page has this tag. <code>Page</code> means it is not a post as such but would have this classification in a more complex blogging structure. I'm using this tag for posts that are a long-form writing project.
</p>

<ul class="org-ul">
<li><a href="https://rillonline.github.io/tag-blog.html">Blog</a></li>
<li><a href="https://rillonline.github.io/tag-caitlin.html">Caitlin</a></li>
<li><a href="https://rillonline.github.io/tag-creativity.html">Creativity</a></li>
<li><a href="https://rillonline.github.io/tag-dog.html">Dog</a></li>
<li><a href="https://rillonline.github.io/tag-elwood.html">Elwood</a></li>
<li><a href="https://rillonline.github.io/tag-emacs.html">Emacs</a></li>
<li><a href="https://rillonline.github.io/tag-faith.html">Faith</a></li>
<li><a href="https://rillonline.github.io/tag-fiction.html">Fiction</a></li>
<li><a href="https://rillonline.github.io/tag-hulu.html">Hulu</a></li>
<li><a href="https://rillonline.github.io/tag-tag-nick.html">Nick</a></li>
<li><a href="https://rillonline.github.io/tag-nina.html">Nina</a></li>
<li><a href="https://rillonline.github.io/tag-org_mode.html">org<sub>mode</sub></a></li>
<li><a href="https://rillonline.github.io/tag-page.html">Page</a></li>
<li><a href="https://rillonline.github.io/tag-raspberry_pi.html">Raspberry<sub>Pi</sub></a></li>
<li><a href="https://rillonline.github.io/tag-writing.html">Writing</a></li>
<li></li>
</ul>





<ul class="org-ul">
<li><a href="https://rillonline.github.io/tag-emacs.html">Emacs</a></li>
</ul>
<div class="taglist"><a href="https://rillonline.github.io/tags.html">Tags</a>: <a href="https://rillonline.github.io/tag-blog.html">Blog</a> </div><footer class="post-footer">
 <p>Thanks for reading.</p>
</footer></div>
<div id="postamble" class="status">
   <div class="post-meta">
   <div class="creator">
   <p>This blog post was created by Rill on a Raspberry Pi, with the help of <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a>, <a href="https://orgmode.org/">Org mode</a>, and the <a href="https://github.com/bastibe/org-static-blog">org-static-blog</a> package.</p>
   </div>
   <div class="copyright-license">
   <p>© 2025 by Rill. Unless otherwise stated, all material is licensed under a <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License</a>.</p>
   </div>
  </div>
 </div>
</body>
</html>
